// пример программы a=2; b=2; a=a+b; #a
// программа записывается в одну строку str[]
// добавим в блок var массив str[]
var 
  str:string[100];
// имена переменных обозначаются строчными буквами 
// массив переенных a,b,c,d
 arr[]: array[0..3] of integer;
// аккумулятор для строчной буквы 
  lowercase_letter_acc:char;
  // и аккумулятор для буквы из аккумулятора lowercase_letter_acc
  // который понадобится для организации цикла 
  lowercase_letter_acc_acc:char;
  // аккумулятор для одноразрядной цифры
  digit_acc:integer;
 // индексная переменная
 i: integer;
 // бинарные арифетические операторы + и -
 binary_operator: char;
 // флаг, обозначающий переход к новой переменной
 flag: boolean;
 
 
 
